Revit 2024 API
SymbolGeometryId.SymbolId Property
 The id of the symbol that is containing the shared geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId SymbolId { get; }
Visual Basic
Public ReadOnly Property SymbolId As ElementId
	Get
Visual C++
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
See Also
SymbolGeometryId Class
Autodesk.Revit.DB Namespace